2023-9-7/78fbb3d99c-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学习kbuild</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">学习kbuild</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1e6f90e">1. KBuild</a>
<ul>
<li><a href="#org51b223a">1.1. Overview</a></li>
<li><a href="#org575e0ad">1.2. kbuild files</a></li>
<li><a href="#org1d2076c">1.3. Kbuild clean infrastructure</a></li>
<li><a href="#org1ad4ee3">1.4. Architecture Makefiles</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1e6f90e" class="outline-2">
<h2 id="org1e6f90e"><span class="section-number-2">1.</span> KBuild</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org51b223a" class="outline-3">
<h3 id="org51b223a"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><p>
Makefiles有五部分组成：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Makefile</td>
<td class="org-left">顶层Makefile</td>
</tr>

<tr>
<td class="org-left">.config</td>
<td class="org-left">内核配置文件</td>
</tr>

<tr>
<td class="org-left">arch/$(ARCH)/Makefile</td>
<td class="org-left">架构配置文件</td>
</tr>

<tr>
<td class="org-left">scripts/Makefile.*</td>
<td class="org-left">普通规则等，对所有kbuild Makefiles生效</td>
</tr>

<tr>
<td class="org-left">kbuild Makefiles</td>
<td class="org-left">大约500多个</td>
</tr>
</tbody>
</table></li>

<li>顶层Makefile的责任是构建两个主要产物：vmlinux(the resident kernel image) &amp; modules(any module files)</li>
<li>顶层Makefile会include arch/$(ARCH)/Makefile</li>
<li>kbuild Makefile采用.config中的信息来构建其中指定的文件列表或目标模组；</li>
<li>scripts/Makefile.*包含所有定义和规则等；</li>
</ol>
</div>
</div>
<div id="outline-container-org575e0ad" class="outline-3">
<h3 id="org575e0ad"><span class="section-number-3">1.2.</span> kbuild files</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<ol class="org-ol">
<li><a id="orgc9519bc"></a>obj-y<br>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>kbuild files 的首选配置文件名是 Makefile，但Kbuild也可用;并且同时存在时，Kbuild具有更好优先级；</li>
<li>定义声明是kbuild files中重要部分；可以定义要构建的文件，特殊编译选项，递归子目录；</li>
<li>obj-y += foo.o 会将foo.c或foo.S编译成foo.o并链接进vmlinux</li>
<li>obj-m += foo.o 会编译foo.ko</li>
<li>Kbuild编译所有\((obj-y)文件；然后调用"\)(AR) rcSTP" 将这些文件合并进built-in.a文件；</li>
<li>built-in.a是一个没有符号表的薄文档；</li>
<li>built-in.a通过脚本scripts/link-mvlinux.sh链接进vmlinux；</li>
<li>obj-y中文件顺序很重要，可重复，第一个会被链接进built-in.a，其他忽略；</li>
<li>链接文件顺序很重要，因为某些函数(module_init() / initcall)会在启动时按顺序进行调用；</li>
</ol>
</div>
</li>
<li><a id="org2929509"></a>obj-m<br>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>obj-m普通情况，只有一个源文件：obj-m += isdn_bsdcomp.o</li>
<li><p>
含有多个源文件：
</p>
<div class="org-src-container">
<pre class="src src-Makefile">     obj-$(CONFIG_ISDN_I4L) += idsn.o
     isdn-y := isdn_net_lib.o isdn_v110.o isdn_common.o
</pre>
</div></li>
<li>模块名最终会是isdn.o；kbuild会编译\((isdn-y)中的文件，然后运行"\)(LD) -r"生成isdn.o；</li>
<li><p>
模块可选源文件：
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">fs/ext2/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">obj-$(</span><span style="font-weight: bold; font-style: italic;">CONFIG_EXT2_FS</span><span style="font-weight: bold; font-style: italic;">)</span> += ext2.o
     <span style="font-weight: bold; font-style: italic;">ext2-y</span> := balloc.o dir.o file.o ialloc.o inode.o ioctl.o \
     namei.o super.o symlink.o
     <span style="font-weight: bold; font-style: italic;">ext2-$(</span><span style="font-weight: bold; font-style: italic;">CONFIG_EXT2_FS_XATTR</span><span style="font-weight: bold; font-style: italic;">)</span> += xattr.o xattr_user.o \
     xattr_trusted.o
</pre>
</div></li>
</ol>
</div>
</li>
<li><a id="org425b186"></a>lib-y<br>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-makefile">  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">fs/Makefile</span>
  <span style="font-weight: bold; font-style: italic;">obj-$(</span><span style="font-weight: bold; font-style: italic;">CONFIG_EXT2_FS</span><span style="font-weight: bold; font-style: italic;">)</span> += ext2/                
</pre>
</div>
<ol class="org-ol">
<li>obj-y += ext2/ 将ext2构建进built-in.a并连接进vmlinux；</li>
<li>obj-m += ext2/ 将ext2构建成module；如果ext2/Makefile中含有obj-y，则视为bug；</li>
</ol>
</div>
</li>
<li><a id="org2155ddb"></a>Compilation flags: ccflags-y/asflags-y/ldflags-y/subdir-ccflags-y/subdir-asflags-y/ccflags-remove-y/asflags-remove-y/CFLAGS_\(@/AFLAGS_\)@<br>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>分别传递给cc, as, ld;</li>
<li><p>
EXTRA_CFLAGS/EXTRA_AFLAGS/EXTRA_LDFLAGS支持但过时；
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">drivers/acpi/acpica/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">ccflags-y</span>                  := -Os -D_LINUX -DBUILDING_ACPICA
     <span style="font-weight: bold; font-style: italic;">ccflags-$(</span><span style="font-weight: bold; font-style: italic;">CONFIG_ACPI_DEBUG</span><span style="font-weight: bold; font-style: italic;">)</span>       += -DACPI_DEBUG_OUTPUT

     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">arch/sparc/kernel/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">asflags-y</span> := -ansi

     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">arch/cris/boot/compressed/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">ldflags-y</span> += -T $(<span style="font-weight: bold; font-style: italic;">srctree</span>)/$(<span style="font-weight: bold; font-style: italic;">src</span>)/decompress_$(<span style="font-weight: bold; font-style: italic;">arch-y</span>).lds
</pre>
</div></li>
<li>顶层KBUILD_CFLAGS作用于整个项目；</li>
<li>subdir-ccflags-y/subdir-asflags-y: 对当前和子目录均有效；subdir-*在命令中的会放在non-sudbid-*之前；</li>
<li>ccflags-remove-y/asflags-remove-y: 移除特殊编译选项；</li>
<li><p>
CFLAGS_\(@/AFLAGS_\)@: 只应用于当前kbuild makefile；可以具体到单个源文件；
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">drivers/scsi/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">CFLAGS_aha152x.o</span> =   -DAHA152X_STAT -DAUTOCONF
     <span style="font-weight: bold; font-style: italic;">CFLAGS_gdth.o</span>    = <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-DDEBUG_GDTH=2 -D__SERIAL__ -D__COM2__ \</span>
<span style="font-weight: bold; font-style: italic;">     -DGDTH_STATISTICS</span>
</pre>
</div></li>
<li>CFLAGS_$@比ccflags-remove-y有更高的优先级；可以重新添加被其删除的编译选项；</li>
</ol>
</div>
</li>
<li><a id="org6db9078"></a>Special Rules<br>
<div class="outline-text-4" id="text-1-2-5">
<ol class="org-ol">
<li>$(src) 是指向Makefile位置的相对目录变量；</li>
<li><p>
$(obj) 是指向目标产物的位置；
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">drivers/scsi/Makefile</span>
     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#29983;&#25104;&#25991;&#20214; drivers/scsi//53c8xx_d.h    </span>
     <span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">obj</span><span style="font-weight: bold;">)/53c8xx_d.h</span>: $(<span style="font-weight: bold; font-style: italic;">src</span>)/53c7,8xx.scr $(<span style="font-weight: bold; font-style: italic;">src</span>)/script_asm.pl
     $(<span style="font-weight: bold; font-style: italic;">CPP</span>) -DCHIP=810 - &lt; $<span style="font-weight: bold; text-decoration: underline;">&lt;</span> | ... $(<span style="font-weight: bold; font-style: italic;">src</span>)/script_asm.pl
</pre>
</div></li>
<li>即便src和obj相同，也得在prerequisite中使用src，target中使用obj；</li>
<li><p>
kecho输出内容到标准输出；
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">arch/blackfin/boot/Makefile</span>
     <span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">obj</span><span style="font-weight: bold;">)/vmImage</span>: $(<span style="font-weight: bold; font-style: italic;">obj</span>)/vmlinux.gz
     $(<span style="font-weight: bold; font-style: italic;">call</span> if_changed,uimage)
     @$(<span style="font-weight: bold; font-style: italic;">kecho</span>) <span style="font-style: italic;">'Kernel: </span><span style="font-weight: bold; font-style: italic;">$</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@</span><span style="font-style: italic;"> is ready'</span>
</pre>
</div></li>
</ol>
</div>
</li>
<li><a id="org0176975"></a>Script invocation<br>
<div class="outline-text-4" id="text-1-2-6">
<ol class="org-ol">
<li>提供了$(CONFIG_SHELL) $(AWK) $(PERL) $(PYTHON) $(PYTHON3)来调用对应的脚本；</li>
</ol>
<div class="org-src-container">
<pre class="src src-makefile">  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Makefile</span>
  <span style="font-weight: bold; font-style: italic;">cmd_depmod</span> = $(<span style="font-weight: bold; font-style: italic;">CONFIG_SHELL</span>) $(<span style="font-weight: bold; font-style: italic;">srctree</span>)/scripts/depmod.sh $(<span style="font-weight: bold; font-style: italic;">DEPMOD</span>) \
  $(<span style="font-weight: bold; font-style: italic;">KERNELRELEASE</span>)        
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org1d2076c" class="outline-3">
<h3 id="org1d2076c"><span class="section-number-3">1.3.</span> Kbuild clean infrastructure</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>"make clean" 删除文件targets listed in $(hostprogs), $(always-y), $(always-m), $(always-), $(extra-y), $(extra-) and $(targets);</li>
<li>还包括文件：files matching the patterns "<b>.[oas]", "</b>.ko", plus some additional files generated by kbuild</li>
<li><p>
还可以通过$(clean-files)指定附加删除文件：
</p>
<div class="org-src-container">
<pre class="src src-makefile">     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">lib/Makefile</span>
     <span style="font-weight: bold; font-style: italic;">clean-files</span> := crc32table.h             
</pre>
</div></li>
<li>$(no-clean-files)可避免某些文件被删除；</li>
</ol>
</div>
</div>
<div id="outline-container-org1ad4ee3" class="outline-3">
<h3 id="org1ad4ee3"><span class="section-number-3">1.4.</span> Architecture Makefiles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
kbuild执行时的步骤：
</p>
<ol class="org-ol">
<li>配置内核，产生文件.config</li>
<li>在include/linux/version.h中产生内核版本</li>
<li>更新所有arch/$(ARCH)/Makefile中指定的其他prerequisites；</li>
<li>递归init-* core-* drivers--* net-* libs-*中所列的目录并构建所有目标；
上述值在arch/$(ARCH)/Makefile中被展开；</li>
<li>链接所有对象文件并产生vmlinux；
最前面链接的对象在head-y中，在arch/$(ARCH)/Makefile中赋值；</li>
<li>架构专有部门做一些必要的延迟处理，并构建最终的bootimage：
<ul class="org-ul">
<li>包括building boot records</li>
<li>准备initrd镜像或其他类似内容</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
